BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny828.PIC
        <edc:SFRDef edc:_addr="0x81" edc:access="nn-nnnnn" edc:cname="TCCR1B" edc:impl="0xDF" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="Prescaler source of Timer/Counter 1" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No Clock Source (Stopped)" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Running, No Prescaling" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Running, CLK/8" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Running, CLK/64" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Running, CLK/256" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Running, CLK/1024" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Running, ExtClk Tx Falling Edge" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Running, ExtClk Tx Rising Edge" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="WGM1" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICES1" edc:desc="Input Capture 1 Edge Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICNC1" edc:desc="Input Capture 1 Noise Canceler" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x82" edc:access="nn------" edc:cname="TCCR1C" edc:impl="0xC0" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC1">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="FOC1B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC1A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x83" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x84" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x86" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ICR1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x88" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1A" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x8A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR1B" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:AdjustPoint edc:_addr="0x8C" edc:offset="0x2C"/>
        <edc:SFRDef edc:_addr="0xB8" edc:access="n-nnnnnn" edc:cname="TWSCRA" edc:impl="0xBF" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI">
              <edc:SFRFieldDef edc:cname="TWSME" edc:desc="TWI Smart Mode Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWPME" edc:desc="TWI Promiscuous Mode Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWSIE" edc:desc="TWI Stop Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWEN" edc:desc="Two-Wire Interface Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWASIE" edc:desc="TWI Address/Stop Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWDIE" edc:desc="TWI Data Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TWSHE" edc:desc="TWI SDA Hold Time Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB9" edc:access="----nnnn" edc:cname="TWSCRB" edc:impl="0xF" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI">
              <edc:SFRFieldDef edc:cname="TWCMD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TWAA" edc:desc="TWI Acknowledge Action" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWHNM" edc:desc="TWI High Noise Mode" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBA" edc:access="nnnnnnnn" edc:cname="TWSSRA" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI">
              <edc:SFRFieldDef edc:cname="TWAS" edc:desc="TWI Address or Stop" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWDIR" edc:desc="TWI Read/Write Direction" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWBE" edc:desc="TWI Bus Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWC" edc:desc="TWI Collision" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWRA" edc:desc="TWI Receive Acknowledge" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWCH" edc:desc="TWI Clock Hold" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWASIF" edc:desc="TWI Address/Stop Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWDIF" edc:desc="TWI Data Interrupt Flag." edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBB" edc:access="nnnnnnnn" edc:cname="TWSAM" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI">
              <edc:SFRFieldDef edc:cname="TWAE" edc:desc="TWI Address Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWSAM" edc:desc="TWI Address Mask Bits" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBC" edc:access="nnnnnnnn" edc:cname="TWSA" edc:nzwidth="0x8" ltx:memberofperipheral="TWI"/>
        <edc:SFRDef edc:_addr="0xBD" edc:access="nnnnnnnn" edc:cname="TWSD" edc:nzwidth="0x8" ltx:memberofperipheral="TWI">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI">
              <edc:SFRFieldDef edc:cname="TWSD" edc:desc="TWI slave data bit" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
