BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny828.PIC
        <edc:AdjustPoint edc:_addr="0xE0" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xE2" edc:access="nnnnnnnn" edc:cname="TOCPMCOE" edc:nzwidth="0x8" ltx:memberofperipheral="TOCPM">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TOCPM">
              <edc:SFRFieldDef edc:cname="TOCC0OE" edc:desc="Timer Output Compare Channel 0 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC1OE" edc:desc="Timer Output Compare Channel 1 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC2OE" edc:desc="Timer Output Compare Channel 2 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC3OE" edc:desc="Timer Output Compare Channel 3 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC4OE" edc:desc="Timer Output Compare Channel 4 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC5OE" edc:desc="Timer Output Compare Channel 5 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC6OE" edc:desc="Timer Output Compare Channel 6 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TOCC7OE" edc:desc="Timer Output Compare Channel 7 Output Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xE3" edc:offset="0x5"/>
        <edc:SFRDef edc:_addr="0xE8" edc:access="nnnnnnnn" edc:cname="TOCPMSA0" edc:nzwidth="0x8" ltx:memberofperipheral="TOCPM">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TOCPM">
              <edc:SFRFieldDef edc:cname="TOCC0S" edc:desc="Timer Output Compare Channel 0 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC1S" edc:desc="Timer Output Compare Channel 1 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC2S" edc:desc="Timer Output Compare Channel 2 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC3S" edc:desc="Timer Output Compare Channel 3 Selection Bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE9" edc:access="nnnnnnnn" edc:cname="TOCPMSA1" edc:nzwidth="0x8" ltx:memberofperipheral="TOCPM">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TOCPM">
              <edc:SFRFieldDef edc:cname="TOCC4S" edc:desc="Timer Output Compare Channel 4 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC5S" edc:desc="Timer Output Compare Channel 5 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC6S" edc:desc="Timer Output Compare Channel 6 Selection Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TOCC7S" edc:desc="Timer Output Compare Channel 7 Selection Bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xEA" edc:offset="0x6"/>
        <edc:SFRDef edc:_addr="0xF0" edc:access="nnnnnnnn" edc:cname="OSCTCAL0A" edc:nzwidth="0x8" ltx:memberofperipheral="CPU"/>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="OSCTCAL0B" edc:nzwidth="0x8" ltx:memberofperipheral="CPU"/>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:beginaddr="0x100" edc:endaddr="0x300" edc:regionid="IRAM"/>
    </edc:RegardlessOfMode>
  </edc:DataSpace>
  <edc:DataFlashSpace edc:endaddr="0x400" edc:magicoffset="0x810000"/>
  <edc:SignaturesSpace edc:magicoffset="0x840000">
    <edc:DeviceIDSector edc:beginaddr="0x0" edc:endaddr="0x3" edc:regionid="SIGNATURES" edc:value="0x1E9314"/>
  </edc:SignaturesSpace>
  <edc:FusesSpace edc:magicoffset="0x820000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x3" edc:regionid="FUSES">
      <edc:DCRDef edc:_addr="0x0" edc:access="nnnn--nn" edc:cname="LOW" edc:factorydefault="0x6E" edc:impl="0xF3" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
            <edc:DCRFieldDef edc:cname="SUT_CKSEL" edc:desc="Select Clock Source" edc:mask="0x33" edc:nzwidth="0x6">
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_14CK_0MS" edc:desc="Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 0 ms" edc:when="(field &amp; 0x33) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_14CK_0MS" edc:desc="Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 0 ms" edc:when="(field &amp; 0x33) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_14CK_4MS1" edc:desc="Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 4.1 ms" edc:when="(field &amp; 0x33) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_14CK_4MS1" edc:desc="Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 4.1 ms" edc:when="(field &amp; 0x33) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_14CK_65MS" edc:desc="Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms" edc:when="(field &amp; 0x33) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_14CK_65MS" edc:desc="Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms" edc:when="(field &amp; 0x33) == 0x30"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_14CK_65MS" edc:desc="Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms" edc:when="(field &amp; 0x33) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_14CK_65MS" edc:desc="Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms" edc:when="(field &amp; 0x33) == 0x31"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_8MHZ_6CK_14CK_0MS" edc:desc="Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 0 ms" edc:when="(field &amp; 0x33) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_8MHZ_6CK_14CK_4MS1" edc:desc="Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 4.1 ms" edc:when="(field &amp; 0x33) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_8MHZ_6CK_14CK_65MS" edc:desc="Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms" edc:when="(field &amp; 0x33) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_8MHZ_6CK_14CK_65MS" edc:desc="Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms" edc:when="(field &amp; 0x33) == 0x32"/>
              <edc:DCRFieldSemantic edc:cname="INTULPOSC_32KHZ_6CK_14CK_0MS" edc:desc="Int. ULP Osc. 32kHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 0 ms" edc:when="(field &amp; 0x33) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="INTULPOSC_32KHZ_6CK_14CK_4MS1" edc:desc="Int. ULP Osc. 32kHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 4.1 ms" edc:when="(field &amp; 0x33) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="INTULPOSC_32KHZ_6CK_14CK_65MS" edc:desc="Int. ULP Osc. 32kHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms" edc:when="(field &amp; 0x33) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="INTULPOSC_32KHZ_6CK_14CK_65MS" edc:desc="Int. ULP Osc. 32kHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms" edc:when="(field &amp; 0x33) == 0x33"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CKOUT" edc:desc="Clock output on PORTB0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CKDIV8" edc:desc="Divide clock by 8 internally" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1" edc:access="nnnnnnnn" edc:cname="HIGH" edc:factorydefault="0xDF" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
            <edc:DCRFieldDef edc:cname="BODLEVEL" edc:desc="Brown-out Detector trigger level" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DISABLED" edc:desc="Brown-out detection disabled" edc:when="(field &amp; 0x7) == 0x07"/>
              <edc:DCRFieldSemantic edc:cname="4V3" edc:desc="Brown-out detection at VCC=4.3 V" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:DCRFieldSemantic edc:cname="2V7" edc:desc="Brown-out detection at VCC=2.7 V" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="1V8" edc:desc="Brown-out detection at VCC=1.8 V" edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EESAVE" edc:desc="Preserve EEPROM through the Chip Erase cycle" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTON" edc:desc="Watch-dog Timer always on" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SPIEN" edc:desc="Serial program downloading (SPI) enabled" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DWEN" edc:desc="Debug Wire enable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RSTDISBL" edc:desc="Reset Disabled (Enable PC6 as i/o pin)]" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
